def is_prime(num):
    # Якщо num менше 2, функція повертає False, оскільки прості числа починаються з 2 і більше.
    if num < 2:
        return False
    # Якщо num дорівнює 2, функція повертає True, оскільки 2 є простим числом.
    if num == 2:
        return True
# У інших випадках функція встановлює початкове значення i рівним 2 і починає перевірку дільників з 2.
    i = 2
    # while, продовжується до тих пір, поки квадрат i (тобто i * i) менший або дорівнює num.Якщо num має дільник більший за його квадратний корінь, то цей дільник також матиме пару менше за квадратний корінь.
    while i * i <= num:
        # У циклі перевіряється, чи num ділиться на i без залишку, тобто num % i == 0. 
        if num % i == 0:
            # Якщо умова виконується, функція повертає False, оскільки num не є простим числом.
            return False
        i += 1
# Якщо у циклі не знайдено дільник, то функція повертає True, оскільки num є простим числом.
    return True

while True:
    try:
        user_input = int(input("Введіть число (або 'q' для виходу): "))
        if user_input < 0:
            print("Будь ласка, введіть натуральне число.")
            continue
        elif user_input == 0 or user_input == 1:
            print("0 та 1 н просте число.")
        elif is_prime(user_input):
            print("Просте число.")
        else:
            print("Не просте число.")
    except ValueError:
        quit_choice = input("Неправильний ввід. Ви хочете вийти (введіть 'q')? ")
        if quit_choice.lower() == 'q':
            break
        else:
            print("Будь ласка, введіть дійсне натуральне число або 'q', щоб вийти.")
